# RevitLink Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceTypes..::..BuiltInExternalResourceTypes..::..RevitLink Property
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class See Also
---
An external resource type representing Revit Links data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalResourceType RevitLink { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RevitLink As ExternalResourceType
	Get
```

Visual C++
---
```text
public:
static property ExternalResourceType^ RevitLink {
	ExternalResourceType^ get ();
}
```

# See Also
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace